In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
tesla_data = pd.read_csv('sample_data/tesla.csv')

In [6]:
tesla_data.head()

         Date       Open   High        Low      Close  Adj Close    Volume
0  29-06-2010  19.000000  25.00  17.540001  23.889999  23.889999  18766300
1  30-06-2010  25.790001  30.42  23.299999  23.830000  23.830000  17187100
2  01-07-2010  25.000000  25.92  20.270000  21.959999  21.959999   8218800
3  02-07-2010  23.000000  23.10  18.709999  19.200001  19.200001   5139800
4  06-07-2010  20.000000  20.00  15.830000  16.110001  16.110001   6866900

In [7]:
tesla_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2193 entries, 0 to 2192
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2193 non-null   object
 1   Open       2193 non-null   float64
 2   High       2193 non-null   float64
 3   Low        2193 non-null   float64
 4   Close      2193 non-null   float64
 5   Adj Close  2193 non-null   float64
 6   Volume     2193 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 120.1+ KB

In [8]:
tesla_data.describe()

              Open         High  ...    Adj Close        Volume
count  2193.000000  2193.000000  ...  2193.000000  2.193000e+03
mean    175.652882   178.710262  ...   175.648555  5.077449e+06
std     115.580903   117.370092  ...   115.580771  4.545398e+06
min      16.139999    16.629999  ...    15.800000  1.185000e+05
25%      33.110001    33.910000  ...    33.160000  1.577800e+06
50%     204.990005   208.160004  ...   204.990005  4.171700e+06
75%     262.000000   265.329987  ...   261.739990  6.885600e+06
max     386.690002   389.609985  ...   385.000000  3.716390e+07

[8 rows x 6 columns]

In [9]:
stock_data = pd.read_csv('sample_data/Google_train_data.csv')

In [10]:
stock_data.head()

       Date    Open    High     Low   Close      Volume
0  1/3/2012  325.25  332.83  324.97  663.59   7,380,500
1  1/4/2012  331.27  333.87  329.08  666.45   5,749,400
2  1/5/2012  329.83  330.75  326.89  657.21   6,590,300
3  1/6/2012  328.34  328.77  323.68  648.24   5,405,900
4  1/9/2012  322.04  322.29  309.46  620.76  11,688,800

In [11]:
stock_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1258 non-null   object
 1   Open    1258 non-null   float64
 2   High    1258 non-null   float64
 3   Low     1258 non-null   float64
 4   Close   1258 non-null   object
 5   Volume  1258 non-null   object
dtypes: float64(3), object(3)
memory usage: 59.1+ KB

In [12]:
stock_data.describe()

              Open         High          Low
count  1258.000000  1258.000000  1258.000000
mean    533.709833   537.880223   529.007409
std     151.904442   153.008811   150.552807
min     279.120000   281.210000   277.220000
25%     404.115000   406.765000   401.765000
50%     537.470000   540.750000   532.990000
75%     654.922500   662.587500   644.800000
max     816.680000   816.680000   805.140000